/*
 * To change this license header, choose License Headers in Project Properties.
 * To change this template file, choose Tools | Templates
 * and open the template in the editor.
 */
package lab6;

/**
 *
 * @author Алексей
 */
public enum Patronymic {
    АЛЕКСАНДРОВИЧ,АДАМОВИЧ,АНАТОЛЬЕВИЧ,АРКАДЬЕВИЧ,АЛЕКСЕЕВИЧ,АНДРЕЕВИЧ,АРТЕМОВИЧ,АЛЬБЕРТОВИЧ,АНТОНОВИЧ,БОГДАНОВИЧ,БОГУСЛАВОВИЧ,БОРИСОВИЧ,ВАДИМОВИЧ,ВАСИЛЬЕВИЧ,ВЛАДИМИРОВИЧ,ВАЛЕНТИНОВИЧ,ВЕНИАМИНОВИЧ,ВЯЧЕСЛАВОВИЧ,ВАЛЕРЬЕВИЧ,ВИКТОРОВИЧ,ГЕННАДИЕВИЧ,ГЕОРГИЕВИЧ,ГЕННАДЬЕВИЧ,ГРИГОРЬЕВИЧ,ДАВИДОВИЧ,ДЕНИСОВИЧ,ДАНИЛОВИЧ,ДМИТРИЕВИЧ,ЕВГЕНЬЕВИЧ,ЕГОРОВИЧ,ЕФИМОВИЧ,ИВАНОВИЧ,ИЛЬИЧ,ИГОРЕВИЧ,ИОСИФОВИЧ,КИРИЛЛОВИЧ,КОНСТАНТИНОВИЧ,ЛЕОНИДОВИЧ,ЛЬВОВИЧ,МАКАРОВИЧ,МАКСОВИЧ,МИРОНОВИЧ,МАКСИМОВИЧ,МАТВЕЕВИЧ,МИХАЙЛОВИЧ,НАТАНОВИЧ,НАУМОВИЧ,НИКОЛАЕВИЧ,ОЛЕГОВИЧ,ОСКАРОВИЧ,ПАВЛОВИЧ,ПЕТРОВИЧ,ПЛАТОНОВИЧ,РОБЕРТОВИЧ,РОСТИСЛАВОВИЧ,РУДОЛЬФОВИЧ,РОМАНОВИЧ,РУБЕНОВИЧ,РУСЛАНОВИЧ,СВЯТОСЛАВОВИЧ,СЕРГЕЕВИЧ,СТЕПАНОВИЧ,СЕМЕНОВИЧ,СТАНИСЛАВОВИЧ,ТАРАСОВИЧ,ТИМОФЕЕВИЧ,ТИМУРОВИЧ,ФЕДОРОВИЧ,ФЕЛИКСОВИЧ,ФИЛИППОВИЧ,ХАРИТОНОВИЧ,ЭДУАРДОВИЧ,ЭМАНУИЛОВИЧ,ЭЛЬДАРОВИЧ,ЮРЬЕВИЧ,ЮХИМОВИЧ,ЯКОВЛЕВИЧ,ЯРОСЛАВОВИЧ
}
