/*
 * To change this license header, choose License Headers in Project Properties.
 * To change this template file, choose Tools | Templates
 * and open the template in the editor.
 */
package lab6;

/**
 *
 * @author Алексей
 */
public enum Surname {
    АБРАМОВ, АВДЕЕВ, АГАФОНОВ, АКСЁНОВ, АЛЕКСАНДРОВ, АЛЕКСЕЕВ, АНДРЕЕВ, АНИСИМОВ, АНТОНОВ, АРТЕМЬЕВ, АРХИПОВ, АФАНАСЬЕВ, БАРАНОВ, БЕЛОВ, БЕЛОЗЁРОВ, БЕЛОУСОВ, БЕЛЯЕВ, БЕЛЯКОВ, БЕСПАЛОВ, БИРЮКОВ, БЛИНОВ, БЛОХИН, БОБРОВ, БОБЫЛЁВ, БОГДАНОВ, БОЛЬШАКОВ, БОРИСОВ, БРАГИН, БУРОВ, БЫКОВ, ВАСИЛЬЕВ, ВЕСЕЛОВ, ВИНОГРАДОВ, ВИШНЯКОВ, ВЛАДИМИРОВ, ВЛАСОВ, ВОЛКОВ, ВОРОБЬЁВ, ВОРОНОВ, ВОРОНЦОВ, ГАВРИЛОВ, ГАЛКИН, ГЕРАСИМОВ, ГОЛУБЕВ, ГОРБАЧЁВ, ГОРБУНОВ, ГОРДЕЕВ, ГОРШКОВ, ГРИГОРЬЕВ, ГРИШИН, ГРОМОВ, ГУЛЯЕВ, ГУРЬЕВ, ГУСЕВ, ГУЩИН, ДАВЫДОВ, ДАНИЛОВ, ДЕМЕНТЬЕВ, ДЕНИСОВ, ДМИТРИЕВ, ДОРОНИН, ДОРОФЕЕВ, ДРОЗДОВ, ДЬЯЧКОВ, ЕВДОКИМОВ, ЕВСЕЕВ, ЕГОРОВ, ЕЛИСЕЕВ, ЕМЕЛЬЯНОВ, ЕРМАКОВ, ЕРШОВ, ЕФИМОВ, ЕФРЕМОВ, ЖДАНОВ, ЖУКОВ, ЖУРАВЛЁВ, ЗАЙЦЕВ, ЗАХАРОВ, ЗИМИН, ЗИНОВЬЕВ, ЗУЕВ, ЗЫКОВ, ИВАНКОВ, ИВАНОВ, ИГНАТОВ, ИГНАТЬЕВ, ИЛЬИН, ИСАЕВ, ИСАКОВ, КАБАНОВ, КАЗАКОВ, КАЛАШНИКОВ, КАЛИНИН, КАПУСТИН, КАРПОВ, КИРИЛЛОВ, КИСЕЛЁВ, КНЯЗЕВ, КОВАЛЁВ, КОЗЛОВ, КОЛЕСНИКОВ, КОЛОБОВ, КОМАРОВ, КОМИССАРОВ, КОНДРАТЬЕВ, КОНОВАЛОВ, КОНОНОВ, КОНСТАНТИНОВ, КОПЫЛОВ, КОРНИЛОВ, КОРОЛЁВ, КОСТИН, КОТОВ, КОШЕЛЕВ, КРАСИЛЬНИКОВ, КРЫЛОВ, КРЮКОВ, КУДРЯВЦЕВ, КУДРЯШОВ, КУЗНЕЦОВ, КУЗЬМИН, КУЛАГИН, КУЛАКОВ, КУЛИКОВ, ЛАВРЕНТЬЕВ, ЛАЗАРЕВ, ЛАПИН, ЛАРИОНОВ, ЛЕБЕДЕВ, ЛИХАЧЁВ, ЛОБАНОВ, ЛОГИНОВ, ЛУКИН, ЛЫТКИН, МАКАРОВ, МАКСИМОВ, МАМОНТОВ, МАРКОВ, МАРТЫНОВ, МАСЛОВ, МАТВЕЕВ, МЕДВЕДЕВ, МЕЛЬНИКОВ, МЕРКУШЕВ, МИРОНОВ, МИХАЙЛОВ, МИХЕЕВ, МИШИН, МОИСЕЕВ, МОЛЧАНОВ, МОРОЗОВ, МУРАВЬЁВ, МУХИН, МЫШКИН, МЯСНИКОВ, НАЗАРОВ, НАУМОВ, НЕКРАСОВ, НЕСТЕРОВ, НИКИТИН, НИКИФОРОВ, НИКОЛАЕВ, НИКОНОВ, НОВИКОВ, НОСКОВ, НОСОВ, ОВЧИННИКОВ, ОДИНЦОВ, ОРЕХОВ, ОРЛОВ, ОСИПОВ, ПАВЛОВ, ПАНОВ, ПАНФИЛОВ, ПАХОМОВ, ПЕСТОВ, ПЕТРОВ, ПЕТУХОВ, ПОЛЯКОВ, ПОНОМАРЁВ, ПОПОВ, ПОТАПОВ, ПРОХОРОВ, РОГОВ, РОДИОНОВ, РОЖКОВ, РОМАНОВ, РУСАКОВ, РЫБАКОВ, РЯБОВ, САВЕЛЬЕВ, САВИН, САЗОНОВ, САМОЙЛОВ, САМСОНОВ, САФОНОВ, СЕЛЕЗНЁВ, СЕЛИВЕРСТОВ, СЕМЁНОВ, СЕРГЕЕВ, СИДОРОВ, СИЛИН, СИМОНОВ, СИТНИКОВ, СОБОЛЕВ, СОКОЛОВ, СОЛОВЬЁВ, СОРОКИН, СТЕПАНОВ, СТРЕЛКОВ, СУББОТИН, СУВОРОВ, СУХАНОВ, СЫСОЕВ, ТАРАСОВ, ТЕРЕНТЬЕВ, ТЕТЕРИН, ТИМОФЕЕВ, ТИТОВ, ТИХОНОВ, ТРЕТЬЯКОВ, ТРОФИМОВ, ТУРОВ, УВАРОВ, УСТИНОВ, ФАДЕЕВ, ФЁДОРОВ, ФЕДОСЕЕВ, ФЕДОТОВ, ФИЛАТОВ, ФИЛИППОВ, ФОКИН, ФОМИН, ФОМИЧЁВ, ФРОЛОВ, ХАРИТОНОВ, ХОХЛОВ, ЦВЕТКОВ, ЧЕРНОВ, ШАРАПОВ, ШАРОВ, ШАШКОВ, ШЕСТАКОВ, ШИЛОВ, ШИРЯЕВ, ШУБИН, ЩЕРБАКОВ, ЩУКИН, ЮДИН, ЯКОВЛЕВ, ЯКУШЕВ
}
